Revit 2024 API
ExportPatternKey Constructor (ExportPatternKey)
 Constructs a new copy of the input ExportPatternKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportPatternKey(
	ExportPatternKey other
)
Visual Basic
Public Sub New ( _
	other As ExportPatternKey _
)
Visual C++
public:
ExportPatternKey(
	ExportPatternKey^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExportPatternKey
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportPatternKey Class
ExportPatternKey Overload
Autodesk.Revit.DB Namespace